#include "cmds.h"

#define T_UNDEFINED			0x00

#define T_BYTE				0x01 << 24
#define T_WORD				0x02 << 24
#define T_FLOAT				0x03 << 24
#define T_TMASK				0x0f << 24

#define T_COMMON			0x10 << 24
#define T_SENS				0x20 << 24
#define T_TUBE				0x30 << 24
#define T_ARC				0x40 << 24
#define T_STMASK			0x70 << 24

#define MAX_CHANNELS	50

void * tekonDeviceThread (void * devr);

class DeviceSPG742;

class DeviceSPG742 : public DeviceD {
public:    
    UINT	idspg;
    UINT	adr;
    CHAR	version[10];
    CHAR	software[10];
    tm 		*devtime;
public:    
    // constructor
    DeviceSPG742 () {};
    ~DeviceSPG742 () {};
    bool ReadVersion ();
    bool ReadTime ();    

    int ReadDataCurrent ();
    int ReadAllArchive (UINT deep);
};

#define MAX_EVENTS		100

#define ANALYSE			1
#define NO_ANALYSE		0

#define TYPE_CURRENTS		0
#define TYPE_HOURS		1
#define TYPE_DAYS		2
#define TYPE_MONTH		4
#define TYPE_INCREMENTS		7
#define TYPE_EVENTS		9
#define TYPE_CONST		10
//-----------------------------------------------------------------------------
#define	START_EXCHANGE	0x3F

#define	M4_GET742_ARCHIVE	0x61
#define	M4_SET742_PARAM		0x77
#define	M4_GET742_PARAM		0x72
#define	GET742_FLASH		0x45

#define DLE 	0x10  	// символ-префикс.
#define HT  	0x09  	// код горизонтальной табуляции
#define ZERO  	0x0 	// просто ноль
#define UK  	0x16  	// управляющий код конца кадра
#define	PNUM	0x4A

#define	TAG_FLOAT	0x41
#define	OCTET_STRING	0x4
#define	ARCHDATE_TAG	0x49
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
static struct _Archive currents742 [] =
    {	{0,16,1026,"Измеренное значение давления газа (P1)",1,0x1,"МПа"},
	{3,16,1028,"Измеренное значение перепада давления газа (dP1)",1,0x1,"МПа"},
	{0,4,1027,"Измеренное значение температуры газа (T1)",1,0x1,"С"},
	{0,11,1024,"Объемный расход газа рабочие условия (Qр1)",1,0x1,"м3/ч"},
	{1,11,1025,"Объемный расход газа (Q1)",1,0x1,"м3/ч"},
	{0,19,1032,"Среднее значение коэффициента сжимаемости",1,0x1,""}, //0x2
	
	{0,21,2048,"Тотальный объем в рабочих условиях по трубе 1",1,0,"м3"},
	{1,21,2049,"Тотальный объем в стандартных условиях по трубе 1",1,0,"м3"}};

static struct _Archive archive742 [] =
    {	{0,16,72,"Среднее значение давления газа (P1)",1,0x2,"МПа"},
	{0,4,78,"Среднее значение температуры газа (T1)",1,0x2,"С"},
	{0,16,84,"Среднее значение перепада давления (dP1)",1,0x2,"МПа"},
	{0,11,90,"Интегральный объем газа рабочие условия (Qр1)",1,0x2,"м3/ч"},
	{1,11,96,"Интегральный объем газа (Q1)",1,0x2,"м3/ч"},
	{0,19,108,"Среднее значение коэффициента сжимаемости",1,0x2,""},
	{1,16,42,"Среднее значение барометрического давления",1,0x2,"мм.рт.с"},
	{0,11,48,"Стандартный объем",1,0x2,"м3"}};

static struct _Archive const742 [] =
{ 	{1,101,25,"Константное значение атмосферного давления",1,0,"мм.рт"},
	{14,114,11,"Доля азота",1,0,"%"},
	{15,115,12,"Доля диоксида углерода",1,0,"%"},
	{1,112,10,"Процент влаги",1,0,"%"},	

	{2,102,9,"Константное значение абсолютного давления",1,1,"МПа"},
	{5,105,24,"Константное значение температуры",1,1,"C"},
	{6,106,9,"Константа плотности газа",1,0,"кг/м3"},
	{8,108,10,"Константа влажности газа",1,0,"%"},

	{21,202,3,"Время пуска счета ( запуск учета ресурсов)",1,0,"с"},
	{22,206,7,"Расчетный час (смешение в секундах)",1,0,"с"},
	{23,207,6,"Расчетные сутки (смещение секунда)",1,0,"с"}};
//-----------------------------------------------------------------------------
static struct _NScode nscode742 [] =
{	{0, "НС00", "Разряд батареи (напряжение батареи меньше порога 3,2 В"},
	{1, "НС01", "ЗАРЕЗЕРВИРОВАНО"},
	{2, "НС02", "Перегрузка по цепям питания датчиков давления (только для модели 02)"},
	{3, "НС03", "Активный уровень сигнала на дискретном входе D2"},
	{4, "НС04", "Сигнал Qр по каналу т1 меньше нижнего предела"},
	{5, "НС05", "Сигнал Qр по каналу т2 меньше нижнего предела"},
	{6, "НС06", "Сигнал Qр по каналу т1 превысил верхний предел"},
	{7, "НС07", "Сигнал Qр по каналу т2 превысил верхний предел"},
	{8, "НС08", "ЗАРЕЗЕРВИРОВАНО"},
	{9, "НС09", "Сигнал на входе ПД1 вне диапазона"},
	{10, "НС10", "Сигнал на входе ПД2 вне диапазона"},
	{11, "НС11", "Сигнал на входе ПД3 вне диапазона"},
	{12, "НС12", "Сигнал на входе ПД4 вне диапазона"},
	{13, "НС13", "Сигнал на входе ПД5 вне диапазона"},
	{14, "НС14", "Температура t1 вне диапазона -52...+92 °C"},
	{15, "НС15", "Температура t2 вне диапазона -52...+92 °C"},
	{16, "НС16", "Параметр P1 вышел за пределы уставок Ув, Ун."},
	{17, "НС17", "Параметр ΔP1 вышел за пределы уставок Ув, Ун."},
	{18, "НС18", "Параметр Qр1 вышел за пределы уставок Ув, Ун."},
	{19, "НС19", "Параметр P2 вышел за пределы уставок Ув, Ун."},
	{20, "НС20", "Параметр ΔP2 вышел за пределы уставок Ув, Ун."},
	{21, "НС21", "Параметр Qр2 вышел за пределы уставок Ув, Ун."},
	{22, "НС22", "Параметр ΔP3 вышел за пределы уставок Ув, Ун."},
	{23, "НС23", "Параметр P3 вышел за пределы уставок Ув, Ун."},
	{24, "НС24", "Параметр P4 вышел за пределы уставок Ув, Ун."},
	{25, "НС25", "Текущее суточное значение V по каналу ОБЩ превышает норму поставки"},
	{26, "НС26", "Отрицательное значение Кп по каналу 1"},
	{27, "НС27", "Отрицательное значение Кп по каналу 2"}};